using System;

namespace _08._Basketball_Equipment
{
    class Program
    {
        static void Main(string[] args)
        {
            //Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка.
            //Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира,
            //като знаете колко е таксата за тренировки по баскетбол за период от 1 година.
            //Нужна екипировка: 

            //  От конзолата се четe 1 ред:
            //Годишната такса за тренировки по баскетбол – цяло число в интервала[0… 9999]
           

            double yearPrice = double.Parse(Console.ReadLine());

            //Баскетболни кецове – цената им е 40 % по - малка от таксата за една година
            double shoe = yearPrice - yearPrice * 0.4;
           
            //Баскетболен екип – цената му е 20 % по - евтина от тази на кецовете
            double clothes = shoe - shoe * 0.20;    

            //Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
            double ballPrice = clothes / 4;

            //Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка

            double accesorries = ballPrice / 5;


            // Изход
            // Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.
            Console.WriteLine(yearPrice+shoe+clothes+ballPrice+accesorries);
        }
    }
}
